# 2988. Manager of the Largest Department

### Table: Employees

| Column Name | Type    |
|-------------|---------|
| emp_id      | int     |
| emp_name    | varchar |
| dep_id      | int     |
| position    | varchar |

`emp_id` is the column of unique values for this table. This table contains `emp_id`, `emp_name`, `dep_id`, and `position`.

## Problem

Write a solution to find the name of the manager from the largest department. There may be multiple largest departments when the number of employees in those departments is the same.

Return the result table sorted by `dep_id` in ascending order.

## Example 1:

**Input:** 

Employees table:
| emp_id | emp_name | dep_id | position      | 
|--------|----------|--------|---------------|
| 156    | Michael  | 107    | Manager       |
| 112    | Lucas    | 107    | Consultant    |    
| 8      | Isabella | 101    | Manager       | 
| 160    | Joseph   | 100    | Manager       | 
| 80     | Aiden    | 100    | Engineer      | 
| 190    | Skylar   | 100    | Freelancer    | 
| 196    | Stella   | 101    | Coordinator   |
| 167    | Audrey   | 100    | Consultant    |
| 97     | Nathan   | 101    | Supervisor    |
| 128    | Ian      | 101    | Administrator |
| 81     | Ethan    | 107    | Administrator |

**Output:**

| manager_name | dep_id | 
|--------------|--------|
| Joseph       | 100    | 
| Isabella     | 101    | 

**Explanation:**
- Departments with IDs `100` and `101` each have a total of 4 employees, while department `107` has 3 employees. Since both departments `100` and `101` have an equal number of employees, their respective managers will be included.
- The output table is ordered by `dep_id` in ascending order.

In [1]:
import pandas as pd

In [2]:
def find_manager(employees: pd.DataFrame) -> pd.DataFrame:
    output_df = employees.groupby('dep_id').count().reset_index()
    output_df = output_df[output_df['emp_id'] == output_df['emp_id'].max()]
    output_df = pd.merge(output_df,employees[employees['position'] == 'Manager'],on='dep_id').rename({'emp_name_y':'manager_name'},axis=1)
    return output_df[['manager_name','dep_id']]

In [3]:
employees_data = {
    'emp_id': [156, 112, 8, 160, 80, 190, 196, 167, 97, 128, 81],
    'emp_name': ['Michael', 'Lucas', 'Isabella', 'Joseph', 'Aiden', 'Skylar', 'Stella', 'Audrey', 'Nathan', 'Ian', 'Ethan'],
    'dep_id': [107, 107, 101, 100, 100, 100, 101, 100, 101, 101, 107],
    'position': ['Manager', 'Consultant', 'Manager', 'Manager', 'Engineer', 'Freelancer', 'Coordinator', 'Consultant', 'Supervisor', 'Administrator', 'Administrator']
}

employees = pd.DataFrame(employees_data)

In [4]:
find_manager(employees=employees)

  manager_name  dep_id
0       Joseph     100
1     Isabella     101